tensorVLV/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 1e5;

boundaryField
{
    outlet
    {
        type            totalPressure;
        p0              uniform 1e5;
    }

    inlet
    {
        type            zeroGradient;
    }

    body
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
// ************************ tensorVLV - 2025 ******************************* //
// ************************** pttensor.com ********************************* //