tensorVLV/Allrun
//generate mesh
blockMesh
snappyHexMesh -overwrite

//running
decomposePar
mpirun -np 8 cavitatingFoam -parallel
reconstructPar
