tensorVLV/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-0.05 -0.05 -0.12) //0
    (0.05 -0.05 -0.12) //1
    (0.05 0.05 -0.12) //2
    (-0.05 0.05 -0.12) //3

    (-0.05 -0.05 0.12) //4
    (0.05 -0.05 0.12) //5
    (0.05 0.05 0.12) //6
    (-0.05 0.05 0.12) //7

);


blocks
(
    hex (0 1 2 3 4 5 6 7)(30 30 60)
    simpleGrading (1 1 1)

);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 2 5 6)
            (0 3 7 4)
            (0 1 5 4)
            (3 2 6 7)
            (4 5 6 7)
        );
    }
    
);


// ***************************************************************** //
// ************************ tensorVLV - 2025 ******************************* //
// ************************** pttensor.com ********************************* //
